Tekla Open API Reference for Tekla Structures 2025
CustomObservableCollection<T> Constructor (List<T>)
 CustomObservableCollection constructor.
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public CustomObservableCollection(
	List<T> list
)
Public Sub New (
	list As List(Of T)
)
Parameters
list
Type: System.Collections.Generic.List<T>
The list used in creation.
See Also
Reference
CustomObservableCollection<T> Class
CustomObservableCollection<T> Overload
Tekla.Structures.Dialog.UIControls Namespace